src/InformationRegisters/am_СкидкиРМК/am_СкидкиРМК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>am_СкидкиРМК</name>
  <resources>
    <name>Отображать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидКарты</name>
    <type>
      <types>CatalogRef.ВидыДисконтныхКарт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/am_СкидкиРМК/ManagerModule.bsl
Функция ЗаписатьКарту(ВидКарты, ОтображатьВРМК) Экспорт
	МенеджерЗаписи = РегистрыСведений.am_СкидкиРМК.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ВидКарты = ВидКарты;
	МенеджерЗаписи.Отображать = ОтображатьВРМК;
	МенеджерЗаписи.Записать(Истина);
КонецФункции

Функция ПолучитьКартыДляРМК() Экспорт
	НаборЗаписей = РегистрыСведений.am_СкидкиРМК.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	                           
	Карты = Новый Массив();
	Для Каждого Набор Из НаборЗаписей Цикл
		Если Набор.Отображать Тогда
			Карты.Добавить(Набор.ВидКарты.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Карты;
КонецФункции

Функция КартаОтображаетсяВРМК(ВидКарты) Экспорт
	НаборЗаписей = РегистрыСведений.am_СкидкиРМК.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВидКарты.Значение = ВидКарты;
	НаборЗаписей.Прочитать();
	
	Для Каждого Набор Из НаборЗаписей Цикл
		Если Набор.ВидКарты = ВидКарты Тогда
			Возврат Набор.Отображать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции
